<!doctype html>
<html lang="en-US">
<head>
  <script type="text/javascript" src="/static/js/jquery-2.1.3.min.js"></script>
  <script type="text/javascript" src="/static/js/bootstrap.min.js"></script>
  <script type="text/javascript" src="/static/js/jquery.tablesorter.min.js"></script>
  <link rel="stylesheet" type="text/css" href="/static/css/bootstrap.min.css"/>

  <script type="text/javascript" src="/static/js/echarts.min.js"></script>
  <!-- <script type="text/javascript" src="/static/js/echarts2.js"></script> -->
  <!-- <script src="http://api.map.baidu.com/api?v=2.0&ak=ZUONbpqGBsYGXNIYHicvbAbM"></script> -->

<body>
  <!-- 为 ECharts 准备一个具备大小（宽高）的 DOM -->
  <div id="main" style="width: 1000px;height:800px;"></div>

  <script type="text/javascript">
  var myChart = echarts.init(document.getElementById('main'));
  // var uploadedDataURL = "/static/js/guangdong.json";
var uploadedDataURL = "/static/js/china.json";
    $.get(uploadedDataURL, function (geoJson) {

    myChart.hideLoading();

    // echarts.registerMap('广东省', geoJson);
    echarts.registerMap('全国', geoJson);
  option = {
    backgroundColor: '#1b1b1b',
    color: ['gold','aqua','lime'],
    title : {
        text: '模拟迁徙',
        subtext:'数据纯属虚构',
        x:'center',
        textStyle : {
            color: '#fff'
        }
    },
    tooltip : {
        trigger: 'item',
        formatter: '{b}'
    },
    legend: {
        orient: 'vertical',
        x:'left',
        data:['北京 Top10', '上海 Top10', '广州 Top10'],
        selectedMode: 'single',
        selected:{
            '上海 Top10' : false,
            '广州 Top10' : false
        },
        textStyle : {
            color: '#fff'
        }
    },
    toolbox: {
        show : true,
        orient : 'vertical',
        x: 'right',
        y: 'center',
        feature : {
            mark : {show: true},
            dataView : {show: true, readOnly: false},
            restore : {show: true},
            saveAsImage : {show: true}
        }
    },
    dataRange: {
        min : 0,
        max : 100,
        calculable : true,
        color: ['#ff3333', 'orange', 'yellow','lime','aqua'],
        textStyle:{
            color:'#fff'
        }
    },

    "tooltip": {
        "trigger": "item"
    },
    "legend": {
        "orient": "horizontal",
        "y": "bottom",
        "x": "center",
        "data": ["1万", "2万", "5万", "10万", "100万"],
        "itemWidth": 30,
        "itemHeight": 30,
        "textStyle": {
            "color": "#fff"
        }
    },
    "geo": {
        "map": "广东省",
        "layoutCenter": ["55%", "50%"],
        "layoutSize": "109%",
        "label": {
            "emphasis": {
                "show": true
            }
        },
        "roam": false,
        "mapLocation": {
            "width": "110%",
            "height": "97%"
        },
        "geoCoord": {
            "越秀": [113.27, 23.13],
            "荔湾": [113.23, 23.13],
            "广州市": [113.27, 23.13],
            "海珠": [113.25, 23.1],
            "天河": [113.35, 23.12],
            "白云": [113.27, 23.17],
            "黄埔": [113.45, 23.1],
            "番禺": [113.35, 22.95],
            "花都": [113.22, 23.4],
            "增城": [113.83, 23.3],
            "从化": [113.58, 23.55],
            "韶关市": [113.6, 24.82],
            "武江": [113.57, 24.8],
            "浈江": [113.6, 24.8],
            "曲江": [113.6, 24.68],
            "始兴": [114.07, 24.95],
            "仁化": [113.75, 25.08],
            "翁源": [114.13, 24.35],
            "新丰": [114.2, 24.07],
            "乐昌": [113.35, 25.13],
            "南雄": [114.3, 25.12],
            "深圳市": [114.05, 22.55],
            "罗湖": [114.12, 22.55],
            "福田": [114.05, 22.53],
            "南山": [113.92, 22.52],
            "宝安": [113.9, 22.57],
            "龙岗": [114.27, 22.73],
            "盐田": [114.22, 22.55],
            "珠海市": [113.57, 22.27],
            "香洲": [113.55, 22.27],
            "斗门": [113.28, 22.22],
            "金湾": [113.4, 22.07],
            "汕头市": [116.68, 23.35],
            "龙湖": [116.72, 23.37],
            "金平": [116.7, 23.37],
            "潮阳": [116.6, 23.27],
            "潮南": [116.43, 23.25],
            "澄海": [116.77, 23.48],
            "南澳": [117.02, 23.42],
            "佛山市": [113.12, 23.02],
            "南海": [113.15, 23.03],
            "顺德市": [113.3, 22.8],
            "三水": [112.87, 23.17],
            "高明": [112.88, 22.9],
            "江门市": [113.08, 22.58],
            "新会": [113.03, 22.47],
            "台山": [112.78, 22.25],
            "开平": [112.67, 22.38],
            "鹤山": [112.97, 22.77],
            "恩平": [112.3, 22.18],
            "湛江市": [110.35, 21.27],
            "赤坎": [110.37, 21.27],
            "霞山": [110.4, 21.2],
            "坡头": [110.47, 21.23],
            "麻章": [110.32, 21.27],
            "遂溪": [110.25, 21.38],
            "徐闻": [110.17, 20.33],
            "廉江": [110.27, 21.62],
            "雷州": [110.08, 20.92],
            "吴川": [110.77, 21.43],
            "茂名市": [110.92, 21.67],
            "茂南": [110.92, 21.63],
            "茂港": [111.02, 21.47],
            "电白": [111, 21.5],
            "高州": [110.85, 21.92],
            "化州": [110.63, 21.67],
            "信宜": [110.95, 22.35],
            "肇庆市": [112.47, 23.05],
            "端州": [112.48, 23.05],
            "鼎湖": [112.57, 23.17],
            "广宁": [112.43, 23.63],
            "怀集": [112.18, 23.92],
            "封开": [111.5, 23.43],
            "德庆": [111.77, 23.15],
            "高要": [112.45, 23.03],
            "四会": [112.68, 23.33],
            "惠州市": [114.42, 23.12],
            "惠城": [114.4, 23.08],
            "惠阳": [114.47, 22.8],
            "博罗": [114.28, 23.18],
            "惠东": [114.72, 22.98],
            "龙门": [114.25, 23.73],
            "梅州市": [116.12, 24.28],
            "梅江": [116.12, 24.32],
            "梅县": [116.05, 24.28],
            "大埔": [116.7, 24.35],
            "丰顺": [116.18, 23.77],
            "五华": [115.77, 23.93],
            "平远": [115.88, 24.57],
            "蕉岭": [116.17, 24.67],
            "兴宁": [115.73, 24.15],
            "汕尾市": [115.37, 22.78],
            "海丰": [115.33, 22.97],
            "陆河": [115.65, 23.3],
            "陆丰": [115.65, 22.95],
            "河源市": [114.7, 23.73],
            "源城": [114.7, 23.73],
            "紫金": [115.18, 23.63],
            "龙川": [115.25, 24.1],
            "连平": [114.48, 24.37],
            "和平": [114.93, 24.45],
            "东源": [114.77, 23.82],
            "阳江市": [111.98, 21.87],
            "江城": [111.95, 21.87],
            "阳西": [111.62, 21.75],
            "阳东": [112.02, 21.88],
            "阳春": [111.78, 22.18],
            "清远市": [113.03, 23.7],
            "清城": [113.02, 23.7],
            "佛冈": [113.53, 23.88],
            "阳山": [112.63, 24.48],
            "清新": [112.98, 23.73],
            "英德": [113.4, 24.18],
            "连州": [112.38, 24.78],
            "东莞市": [113.75, 23.05],
            "中山市": [113.38, 22.52],
            "潮州市": [116.62, 23.67],
            "湘桥": [116.63, 23.68],
            "潮安": [116.68, 23.45],
            "饶平": [117, 23.67],
            "揭阳市": [116.37, 23.55],
            "揭东": [116.42, 23.57],
            "揭西": [115.83, 23.43],
            "惠来": [116.28, 23.03],
            "普宁": [116.18, 23.3],
            "云浮市": [112.03, 22.92],
            "云城": [112.03, 22.93],
            "新兴": [112.23, 22.7],
            "郁南": [111.53, 23.23],
            "云安": [112, 23.08],
            "罗定": [111.57, 22.77]
        },
        "itemStyle": {
            "normal": {
                "areaColor": "#3aa1bc",
                "borderColor": "#111"
            },
            "emphasis": {
                "areaColor": "#2a333d"
            }
        }
    },
    "series": [{
            name: '全国',
            type: 'map',
            roam: true,
            hoverable: false,
            mapType: 'china',
            itemStyle:{
                normal:{
                    borderColor:'rgba(100,149,237,1)',
                    borderWidth:0.5,
                    areaStyle:{
                        color: '#1b1b1b'
                    }
                }
            },
            data:[],
            markLine : {
                smooth:true,
                symbol: ['none', 'circle'],  
                symbolSize : 1,
                itemStyle : {
                    normal: {
                        color:'#fff',
                        borderWidth:1,
                        borderColor:'rgba(30,144,255,0.5)'
                    }
                },
                data : [
                    [{name:'北京'},{name:'包头'}],
                    [{name:'北京'},{name:'北海'}],
                    [{name:'北京'},{name:'广州'}],
                    [{name:'北京'},{name:'郑州'}],
                    [{name:'北京'},{name:'长春'}],
                    [{name:'北京'},{name:'长治'}],
                    [{name:'北京'},{name:'重庆'}],
                    [{name:'北京'},{name:'长沙'}],
                    [{name:'北京'},{name:'成都'}],
                    [{name:'北京'},{name:'常州'}],
                    [{name:'北京'},{name:'丹东'}],
                    [{name:'北京'},{name:'大连'}],
                    [{name:'北京'},{name:'东营'}],
                    [{name:'北京'},{name:'延安'}],
                    [{name:'北京'},{name:'福州'}],
                    [{name:'北京'},{name:'海口'}],
                    [{name:'北京'},{name:'呼和浩特'}],
                    [{name:'北京'},{name:'合肥'}],
                    [{name:'北京'},{name:'杭州'}],
                    [{name:'北京'},{name:'哈尔滨'}],
                    [{name:'北京'},{name:'舟山'}],
                    [{name:'北京'},{name:'银川'}],
                    [{name:'北京'},{name:'衢州'}],
                    [{name:'北京'},{name:'南昌'}],
                    [{name:'北京'},{name:'昆明'}],
                    [{name:'北京'},{name:'贵阳'}],
                    [{name:'北京'},{name:'兰州'}],
                    [{name:'北京'},{name:'拉萨'}],
                    [{name:'北京'},{name:'连云港'}],
                    [{name:'北京'},{name:'临沂'}],
                    [{name:'北京'},{name:'柳州'}],
                    [{name:'北京'},{name:'宁波'}],
                    [{name:'北京'},{name:'南京'}],
                    [{name:'北京'},{name:'南宁'}],
                    [{name:'北京'},{name:'南通'}],
                    [{name:'北京'},{name:'上海'}],
                    [{name:'北京'},{name:'沈阳'}],
                    [{name:'北京'},{name:'西安'}],
                    [{name:'北京'},{name:'汕头'}],
                    [{name:'北京'},{name:'深圳'}],
                    [{name:'北京'},{name:'青岛'}],
                    [{name:'北京'},{name:'济南'}],
                    [{name:'北京'},{name:'太原'}],
                    [{name:'北京'},{name:'乌鲁木齐'}],
                    [{name:'北京'},{name:'潍坊'}],
                    [{name:'北京'},{name:'威海'}],
                    [{name:'北京'},{name:'温州'}],
                    [{name:'北京'},{name:'武汉'}],
                    [{name:'北京'},{name:'无锡'}],
                    [{name:'北京'},{name:'厦门'}],
                    [{name:'北京'},{name:'西宁'}],
                    [{name:'北京'},{name:'徐州'}],
                    [{name:'北京'},{name:'烟台'}],
                    [{name:'北京'},{name:'盐城'}],
                    [{name:'北京'},{name:'珠海'}],
                    [{name:'上海'},{name:'包头'}],
                    [{name:'上海'},{name:'北海'}],
                    [{name:'上海'},{name:'广州'}],
                    [{name:'上海'},{name:'郑州'}],
                    [{name:'上海'},{name:'长春'}],
                    [{name:'上海'},{name:'重庆'}],
                    [{name:'上海'},{name:'长沙'}],
                    [{name:'上海'},{name:'成都'}],
                    [{name:'上海'},{name:'丹东'}],
                    [{name:'上海'},{name:'大连'}],
                    [{name:'上海'},{name:'福州'}],
                    [{name:'上海'},{name:'海口'}],
                    [{name:'上海'},{name:'呼和浩特'}],
                    [{name:'上海'},{name:'合肥'}],
                    [{name:'上海'},{name:'哈尔滨'}],
                    [{name:'上海'},{name:'舟山'}],
                    [{name:'上海'},{name:'银川'}],
                    [{name:'上海'},{name:'南昌'}],
                    [{name:'上海'},{name:'昆明'}],
                    [{name:'上海'},{name:'贵阳'}],
                    [{name:'上海'},{name:'兰州'}],
                    [{name:'上海'},{name:'拉萨'}],
                    [{name:'上海'},{name:'连云港'}],
                    [{name:'上海'},{name:'临沂'}],
                    [{name:'上海'},{name:'柳州'}],
                    [{name:'上海'},{name:'宁波'}],
                    [{name:'上海'},{name:'南宁'}],
                    [{name:'上海'},{name:'北京'}],
                    [{name:'上海'},{name:'沈阳'}],
                    [{name:'上海'},{name:'秦皇岛'}],
                    [{name:'上海'},{name:'西安'}],
                    [{name:'上海'},{name:'石家庄'}],
                    [{name:'上海'},{name:'汕头'}],
                    [{name:'上海'},{name:'深圳'}],
                    [{name:'上海'},{name:'青岛'}],
                    [{name:'上海'},{name:'济南'}],
                    [{name:'上海'},{name:'天津'}],
                    [{name:'上海'},{name:'太原'}],
                    [{name:'上海'},{name:'乌鲁木齐'}],
                    [{name:'上海'},{name:'潍坊'}],
                    [{name:'上海'},{name:'威海'}],
                    [{name:'上海'},{name:'温州'}],
                    [{name:'上海'},{name:'武汉'}],
                    [{name:'上海'},{name:'厦门'}],
                    [{name:'上海'},{name:'西宁'}],
                    [{name:'上海'},{name:'徐州'}],
                    [{name:'上海'},{name:'烟台'}],
                    [{name:'上海'},{name:'珠海'}],
                    [{name:'广州'},{name:'北海'}],
                    [{name:'广州'},{name:'郑州'}],
                    [{name:'广州'},{name:'长春'}],
                    [{name:'广州'},{name:'重庆'}],
                    [{name:'广州'},{name:'长沙'}],
                    [{name:'广州'},{name:'成都'}],
                    [{name:'广州'},{name:'常州'}],
                    [{name:'广州'},{name:'大连'}],
                    [{name:'广州'},{name:'福州'}],
                    [{name:'广州'},{name:'海口'}],
                    [{name:'广州'},{name:'呼和浩特'}],
                    [{name:'广州'},{name:'合肥'}],
                    [{name:'广州'},{name:'杭州'}],
                    [{name:'广州'},{name:'哈尔滨'}],
                    [{name:'广州'},{name:'舟山'}],
                    [{name:'广州'},{name:'银川'}],
                    [{name:'广州'},{name:'南昌'}],
                    [{name:'广州'},{name:'昆明'}],
                    [{name:'广州'},{name:'贵阳'}],
                    [{name:'广州'},{name:'兰州'}],
                    [{name:'广州'},{name:'拉萨'}],
                    [{name:'广州'},{name:'连云港'}],
                    [{name:'广州'},{name:'临沂'}],
                    [{name:'广州'},{name:'柳州'}],
                    [{name:'广州'},{name:'宁波'}],
                    [{name:'广州'},{name:'南京'}],
                    [{name:'广州'},{name:'南宁'}],
                    [{name:'广州'},{name:'南通'}],
                    [{name:'广州'},{name:'北京'}],
                    [{name:'广州'},{name:'上海'}],
                    [{name:'广州'},{name:'沈阳'}],
                    [{name:'广州'},{name:'西安'}],
                    [{name:'广州'},{name:'石家庄'}],
                    [{name:'广州'},{name:'汕头'}],
                    [{name:'广州'},{name:'青岛'}],
                    [{name:'广州'},{name:'济南'}],
                    [{name:'广州'},{name:'天津'}],
                    [{name:'广州'},{name:'太原'}],
                    [{name:'广州'},{name:'乌鲁木齐'}],
                    [{name:'广州'},{name:'温州'}],
                    [{name:'广州'},{name:'武汉'}],
                    [{name:'广州'},{name:'无锡'}],
                    [{name:'广州'},{name:'厦门'}],
                    [{name:'广州'},{name:'西宁'}],
                    [{name:'广州'},{name:'徐州'}],
                    [{name:'广州'},{name:'烟台'}],
                    [{name:'广州'},{name:'盐城'}]
                ],
            },
            geoCoord: {
                '上海': [121.4648,31.2891],
                '东莞': [113.8953,22.901],
                '东营': [118.7073,37.5513],
                '中山': [113.4229,22.478],
                '临汾': [111.4783,36.1615],
                '临沂': [118.3118,35.2936],
                '丹东': [124.541,40.4242],
                '丽水': [119.5642,28.1854],
                '乌鲁木齐': [87.9236,43.5883],
                '佛山': [112.8955,23.1097],
                '保定': [115.0488,39.0948],
                '兰州': [103.5901,36.3043],
                '包头': [110.3467,41.4899],
                '北京': [116.4551,40.2539],
                '北海': [109.314,21.6211],
                '南京': [118.8062,31.9208],
                '南宁': [108.479,23.1152],
                '南昌': [116.0046,28.6633],
                '南通': [121.1023,32.1625],
                '厦门': [118.1689,24.6478],
                '台州': [121.1353,28.6688],
                '合肥': [117.29,32.0581],
                '呼和浩特': [111.4124,40.4901],
                '咸阳': [108.4131,34.8706],
                '哈尔滨': [127.9688,45.368],
                '唐山': [118.4766,39.6826],
                '嘉兴': [120.9155,30.6354],
                '大同': [113.7854,39.8035],
                '大连': [122.2229,39.4409],
                '天津': [117.4219,39.4189],
                '太原': [112.3352,37.9413],
                '威海': [121.9482,37.1393],
                '宁波': [121.5967,29.6466],
                '宝鸡': [107.1826,34.3433],
                '宿迁': [118.5535,33.7775],
                '常州': [119.4543,31.5582],
                '广州': [113.5107,23.2196],
                '廊坊': [116.521,39.0509],
                '延安': [109.1052,36.4252],
                '张家口': [115.1477,40.8527],
                '徐州': [117.5208,34.3268],
                '德州': [116.6858,37.2107],
                '惠州': [114.6204,23.1647],
                '成都': [103.9526,30.7617],
                '扬州': [119.4653,32.8162],
                '承德': [117.5757,41.4075],
                '拉萨': [91.1865,30.1465],
                '无锡': [120.3442,31.5527],
                '日照': [119.2786,35.5023],
                '昆明': [102.9199,25.4663],
                '杭州': [119.5313,29.8773],
                '枣庄': [117.323,34.8926],
                '柳州': [109.3799,24.9774],
                '株洲': [113.5327,27.0319],
                '武汉': [114.3896,30.6628],
                '汕头': [117.1692,23.3405],
                '江门': [112.6318,22.1484],
                '沈阳': [123.1238,42.1216],
                '沧州': [116.8286,38.2104],
                '河源': [114.917,23.9722],
                '泉州': [118.3228,25.1147],
                '泰安': [117.0264,36.0516],
                '泰州': [120.0586,32.5525],
                '济南': [117.1582,36.8701],
                '济宁': [116.8286,35.3375],
                '海口': [110.3893,19.8516],
                '淄博': [118.0371,36.6064],
                '淮安': [118.927,33.4039],
                '深圳': [114.5435,22.5439],
                '清远': [112.9175,24.3292],
                '温州': [120.498,27.8119],
                '渭南': [109.7864,35.0299],
                '湖州': [119.8608,30.7782],
                '湘潭': [112.5439,27.7075],
                '滨州': [117.8174,37.4963],
                '潍坊': [119.0918,36.524],
                '烟台': [120.7397,37.5128],
                '玉溪': [101.9312,23.8898],
                '珠海': [113.7305,22.1155],
                '盐城': [120.2234,33.5577],
                '盘锦': [121.9482,41.0449],
                '石家庄': [114.4995,38.1006],
                '福州': [119.4543,25.9222],
                '秦皇岛': [119.2126,40.0232],
                '绍兴': [120.564,29.7565],
                '聊城': [115.9167,36.4032],
                '肇庆': [112.1265,23.5822],
                '舟山': [122.2559,30.2234],
                '苏州': [120.6519,31.3989],
                '莱芜': [117.6526,36.2714],
                '菏泽': [115.6201,35.2057],
                '营口': [122.4316,40.4297],
                '葫芦岛': [120.1575,40.578],
                '衡水': [115.8838,37.7161],
                '衢州': [118.6853,28.8666],
                '西宁': [101.4038,36.8207],
                '西安': [109.1162,34.2004],
                '贵阳': [106.6992,26.7682],
                '连云港': [119.1248,34.552],
                '邢台': [114.8071,37.2821],
                '邯郸': [114.4775,36.535],
                '郑州': [113.4668,34.6234],
                '鄂尔多斯': [108.9734,39.2487],
                '重庆': [107.7539,30.1904],
                '金华': [120.0037,29.1028],
                '铜川': [109.0393,35.1947],
                '银川': [106.3586,38.1775],
                '镇江': [119.4763,31.9702],
                '长春': [125.8154,44.2584],
                '长沙': [113.0823,28.2568],
                '长治': [112.8625,36.4746],
                '阳泉': [113.4778,38.0951],
                '青岛': [120.4651,36.3373],
                '韶关': [113.7964,24.7028]
            }
        },
        {
            name: '北京 Top10',
            type: 'map',
            mapType: 'china',
            data:[],
            markLine : {
                smooth:true,
                effect : {
                    show: true,
                    scaleSize: 1,
                    period: 30,
                    color: '#fff',
                    shadowBlur: 10
                },
                itemStyle : {
                    normal: {
                        borderWidth:1,
                        lineStyle: {
                            type: 'solid',
                            shadowBlur: 10
                        }
                    }
                },
                data : [
                    [{name:'北京'}, {name:'上海',value:95}],
                    [{name:'北京'}, {name:'广州',value:90}],
                    [{name:'北京'}, {name:'大连',value:80}],
                    [{name:'北京'}, {name:'南宁',value:70}],
                    [{name:'北京'}, {name:'南昌',value:60}],
                    [{name:'北京'}, {name:'拉萨',value:50}],
                    [{name:'北京'}, {name:'长春',value:40}],
                    [{name:'北京'}, {name:'包头',value:30}],
                    [{name:'北京'}, {name:'重庆',value:20}],
                    [{name:'北京'}, {name:'常州',value:10}]
                ]
            },
            markPoint : {
                symbol:'emptyCircle',
                symbolSize : function (v){
                    return 10 + v/10
                },
                effect : {
                    show: true,
                    shadowBlur : 0
                },
                itemStyle:{
                    normal:{
                        label:{show:false}
                    },
                    emphasis: {
                        label:{position:'top'}
                    }
                },
                data : [
                    {name:'上海',value:95},
                    {name:'广州',value:90},
                    {name:'大连',value:80},
                    {name:'南宁',value:70},
                    {name:'南昌',value:60},
                    {name:'拉萨',value:50},
                    {name:'长春',value:40},
                    {name:'包头',value:30},
                    {name:'重庆',value:20},
                    {name:'常州',value:10}
                ]
            }
        },
    {
        "name": "1万",
        "type": "effectScatter",
        "coordinateSystem": "geo",
        "data": [{
            "name": "珠海市",
            "value": [113.57, 22.27, 100]
        }, {
            "name": "汕尾市",
            "value": [115.37, 22.78, 100]
        }, {
            "name": "东莞市",
            "value": [113.75, 23.05, 100]
        }, {
            "name": "中山市",
            "value": [113.38, 22.52, 100]
        }],
        "rippleEffect": {
            "period": 4,
            "scale": 2.5,
            "brushType": "fill"
        },
        "label": {
            "normal": {
                "formatter": "{b}",
                "position": "right",
                "show": true
            },
            "emphasis": {
                "show": true
            }
        },
        "itemStyle": {
            "normal": {
                "color": "#FFFFC3"
            }
        }
      }, {
        "name": "2万",
        "type": "effectScatter",
        "coordinateSystem": "geo",
        "data": [{
            "name": "广州市",
            "value": [113.27, 23.13, 150]
        }, {
            "name": "深圳市",
            "value": [114.05, 22.55, 150]
        }, {
            "name": "江门市",
            "value": [113.08, 22.58, 150]
        }],
        "rippleEffect": {
            "period": 4,
            "scale": 2.5,
            "brushType": "fill"
        },
        "label": {
            "normal": {
                "formatter": "{b}",
                "position": "right",
                "show": true
            },
            "emphasis": {
                "show": true
            }
        },
        "itemStyle": {
            "normal": {
                "color": "#C7AB0E"
            }
        }
      }, {
        "name": "5万",
        "type": "effectScatter",
        "coordinateSystem": "geo",
        "data": [{
            "name": "佛山市",
            "value": [113.12, 23.02, 250]
        }, {
            "name": "梅州市",
            "value": [116.12, 24.28, 250]
        }, {
            "name": "潮州市",
            "value": [116.62, 23.67, 250]
        }],
        "rippleEffect": {
            "period": 4,
            "scale": 2.5,
            "brushType": "fill"
        },
        "label": {
            "normal": {
                "formatter": "{b}",
                "position": "right",
                "show": true
            },
            "emphasis": {
                "show": true
            }
        },
        "itemStyle": {
            "normal": {
                "color": "#CD3E0A"
            }
        }
      }, {
        "name": "10万",
        "type": "effectScatter",
        "coordinateSystem": "geo",
        "data": [],
        "rippleEffect": {
            "period": 4,
            "scale": 2.5,
            "brushType": "fill"
        },
        "label": {
            "normal": {
                "formatter": "{b}",
                "position": "right",
                "show": true
            },
            "emphasis": {
                "show": true
            }
        },
        "itemStyle": {
            "normal": {
                "color": "#9B0A4C"
            }
        }
      }, {
        "name": "100万",
        "type": "effectScatter",
        "coordinateSystem": "geo",
        "data": [{
            "name": "惠州市",
            "value": [114.42, 23.12, 400]
        }, {
            "name": "揭阳市",
            "value": [116.37, 23.55, 400]
        }],
        "rippleEffect": {
            "period": 4,
            "scale": 2.5,
            "brushType": "fill"
        },
        "label": {
            "normal": {
                "formatter": "{b}",
                "position": "right",
                "show": true
            },
            "emphasis": {
                "show": true
            }
        },
        "itemStyle": {
            "normal": {
                "color": "#78168B"
            }
        }
    }]
    };
    myChart.setOption(option);
    });


var szRoad = {
    success: true,
    errorCode: 0,
    errorMsg: "成功",
    data: [

{ROAD_LINE: "104.096113,30.615077;104.098278,30.615873;104.098292,30.615875;104.098818,30.615953;104.098848,30.616028;104.098870,30.616195;104.098732,30.617522;104.098509,30.620377;104.098505,30.620469;104.097949,30.622939;104.097576,30.623194;104.097317,30.623492;104.094637,30.625320;104.094115,30.625740;104.094119,30.625785;104.094477,30.627981;104.094801,30.629104;104.094954,30.629733;104.094943,30.630138;104.094949,30.630221;104.094774,30.630891;104.094425,30.631573;104.093507,30.633908;104.092901,30.635783;104.092741,30.636169;104.090898,30.639007;104.088691,30.641360;104.085363,30.642658;104.083635,30.643239;104.081910,30.643978;104.081657,30.644021;104.080126,30.644908;104.078022,30.645938;104.074251,30.646484;104.070599,30.646582;104.067798,30.647174;104.066191,30.648032;104.066197,30.648432;104.066192,30.648534;104.066108,30.651254;104.066112,30.651402;104.066099,30.651729;104.066094,30.651789;104.066055,30.651950;104.065885,30.651965;104.065885,30.651965"},

{ROAD_LINE: "104.096219,30.615181;104.097324,30.615673;104.098197,30.615909;104.098201,30.615910;104.098289,30.615912;104.098302,30.615907;104.098307,30.615907;104.098307,30.615906;104.098308,30.615905;104.098319,30.615906;104.098621,30.615942;104.098830,30.616259;104.098763,30.617050;104.098741,30.617316;104.098741,30.617319;104.098699,30.617706;104.098633,30.618562;104.098556,30.619514;104.098473,30.620439;104.098404,30.621110;104.098411,30.621215;104.098430,30.621279;104.098448,30.621402;104.098468,30.621404;104.098456,30.621475;104.098434,30.621619;104.098393,30.621843;104.098374,30.621848;104.098360,30.621855;104.098347,30.621858;104.098346,30.621858;104.098340,30.621858;104.098334,30.621858;104.098331,30.621858;104.098326,30.622169;104.098276,30.622466;104.098248,30.622542;104.098244,30.622551;104.098246,30.622553;104.098226,30.622597;104.098145,30.622715;104.097899,30.622977;104.097697,30.623157;104.097623,30.623245;104.097576,30.623297;104.097581,30.623304;104.097585,30.623310;104.097584,30.623313;104.097583,30.623314;104.097583,30.623315;104.097585,30.623316;104.097586,30.623323;104.097583,30.623324;104.097582,30.623324;104.097581,30.623325;104.097580,30.623323;104.097577,30.623324;104.097240,30.623623;104.096607,30.624251;104.095944,30.624744;104.094765,30.625299;104.094177,30.625863;104.094263,30.626593;104.094393,30.627573;104.094604,30.628410;104.094757,30.628976;104.094955,30.629725;104.094881,30.630476;104.094555,30.631356;104.094082,30.632227;104.094033,30.632320;104.094031,30.632321;104.094030,30.632324;104.094000,30.632383;104.093997,30.632384;104.093900,30.632610;104.093671,30.633281;104.093417,30.634183;104.093240,30.634920;104.093109,30.635319;104.093104,30.635321;104.093101,30.635319;104.093098,30.635317;104.093098,30.635310;104.093047,30.635436;104.092870,30.635899;104.092628,30.636460;104.092341,30.637054;104.091829,30.637879;104.091300,30.638574;104.090756,30.639275;104.090156,30.639897;104.089498,30.640640;104.088887,30.641253;104.088284,30.641636;104.087379,30.641986;104.086441,30.642296;104.085655,30.642562;104.084780,30.642780;104.084148,30.643025;104.083565,30.643225;104.083126,30.643397;104.082944,30.643476;104.082447,30.643711;104.082266,30.643829;104.082256,30.643840;104.082244,30.643842;104.082036,30.643929;104.081666,30.644090;104.081353,30.644251;104.080829,30.644554;104.080081,30.645001;104.079370,30.645409;104.078925,30.645620;104.078102,30.645932;104.077155,30.646104;104.075721,30.646285;104.073996,30.646420;104.072401,30.646508;104.070587,30.646574;104.068869,30.646873;104.067313,30.647283;104.066350,30.647540;104.066241,30.648029;104.066193,30.649206;104.066127,30.650438;104.066092,30.651504;104.066114,30.652035;104.066059,30.652060;104.065990,30.652038;104.065919,30.652173;104.065956,30.652281;104.065969,30.652302;104.065983,30.652306;104.065774,30.652546;104.064647,30.652659;104.063229,30.652817;104.062226,30.653311;104.061123,30.654075;104.061469,30.654502;104.062369,30.654512;104.063467,30.654524;104.064486,30.654562;104.065423,30.654592;104.065763,30.654438;104.065759,30.654027;104.065759,30.654027"},]
}

var busLines = [];
var data = szRoad.data;
var hStep = 300 / (data.length - 1);

var i = 0;
for (var x in data) {
    // i++;
    // if(i<5000)
    //     continue;
    var line = data[x];
    // if(busLines.length>500)
    //     break;
    var pointString = line.ROAD_LINE;
    var pointArr = pointString.split(';');
    var lnglats = [];
    for (var j in pointArr) {
        lnglats.push(pointArr[j].split(','))
    }
    busLines.push({
        coords: lnglats,
        lineStyle: {
            normal: {
                color: echarts.color.modifyHSL('#5A94DF', Math.round(hStep * x))
            }
        }
    })
}

option = {
    bmap: {
        center: [104.091, 30.639],
        zoom: 15,
        roam: true,
        mapStyle: {
            'styleJson': [{
                'featureType': 'water',
                'elementType': 'all',
                'stylers': {
                    'color': '#031628'
                }
            }, {
                'featureType': 'land',
                'elementType': 'geometry',
                'stylers': {
                    'color': '#000102'
                }
            }, {
                'featureType': 'highway',
                'elementType': 'all',
                'stylers': {
                    'visibility': 'off'
                }
            }, {
                'featureType': 'arterial',
                'elementType': 'geometry.fill',
                'stylers': {
                    'color': '#000000'
                }
            }, {
                'featureType': 'arterial',
                'elementType': 'geometry.stroke',
                'stylers': {
                    'color': '#0b3d51'
                }
            }, {
                'featureType': 'local',
                'elementType': 'geometry',
                'stylers': {
                    'color': '#000000'
                }
            }, {
                'featureType': 'railway',
                'elementType': 'geometry.fill',
                'stylers': {
                    'color': '#000000'
                }
            }, {
                'featureType': 'railway',
                'elementType': 'geometry.stroke',
                'stylers': {
                    'color': '#08304b'
                }
            }, {
                'featureType': 'subway',
                'elementType': 'geometry',
                'stylers': {
                    'lightness': -70
                }
            }, {
                'featureType': 'building',
                'elementType': 'geometry.fill',
                'stylers': {
                    'color': '#000000'
                }
            }, {
                'featureType': 'all',
                'elementType': 'labels.text.fill',
                'stylers': {
                    'color': '#857f7f'
                }
            }, {
                'featureType': 'all',
                'elementType': 'labels.text.stroke',
                'stylers': {
                    'color': '#000000'
                }
            }, {
                'featureType': 'building',
                'elementType': 'geometry',
                'stylers': {
                    'color': '#022338'
                }
            }, {
                'featureType': 'green',
                'elementType': 'geometry',
                'stylers': {
                    'color': '#062032'
                }
            }, {
                'featureType': 'boundary',
                'elementType': 'all',
                'stylers': {
                    'color': '#465b6c'
                }
            }, {
                'featureType': 'manmade',
                'elementType': 'all',
                'stylers': {
                    'color': '#022338'
                }
            }, {
                'featureType': 'label',
                'elementType': 'all',
                'stylers': {
                    'visibility': 'off'
                }
            }]
        }
    },
    series: [{
        type: 'lines',
        coordinateSystem: 'bmap',
        polyline: true,
        data: busLines,
        silent: true,
        lineStyle: {
            normal: {
                // color: '#c23531',
                // color: 'rgb(200, 35, 45)',
                opacity: 0.2,
                width: 1
            }
        },
        progressiveThreshold: 500,
        progressive: 200
    }, {
        type: 'lines',
        coordinateSystem: 'bmap',
        polyline: true,
        data: busLines,
        lineStyle: {
            normal: {
                width: 0
            }
        },
        effect: {
            constantSpeed: 50,
            show: true,
            trailLength: 0.5,
            symbolSize: 1.5
        },
        zlevel: 1
    }]
  };

  </script>

</body>
</html>

<!-- var guanzhouURL = "/asset/get/s/data-1491362911797-SkuvE1zpe.json";
$.get(guanzhouURL, function(as) {
    echarts.registerMap('ch', as);

    var geoCoordMap = {
        '荔湾区': [113.243038, 23.124943],
        '天河区': [113.335367, 23.13559],
        '越秀区': [113.280714, 23.125624],
        '白云区': [113.262831, 23.162281],
        '黄埔区': [113.450761, 23.103239],
        '海珠区': [113.262008, 23.103131],
        '增城区': [113.829579, 23.290497],
        '从化区': [113.587386, 23.545283],
        '花都区': [113.211184, 23.39205],
        '番禺区': [113.364619, 22.938582],
        '南沙区': [113.53738, 22.794531]

    };
    var pointData = []
    var dt = [{
        name: '荔湾区',
        value: 0
    }, {
        name: '天河区',
        value: 120
    }, {
        name: '越秀区',
        value: 1200
    }, {
        name: '白云区',
        value: 2200
    }, {
        name: '黄埔区',
        value: 3200
    }, {
        name: '海珠区',
        value: 5000
    }, {
        name: '增城区',
        value: 4200
    }, {
        name: '从化区',
        value: 7100
    }, {
        name: '花都区',
        value: 7100
    }, {
        name: '番禺区',
        value: 8100
    }, {
        name: '南沙区',
        value: 9100
    }];
    var planePath = 'path://M1705.06,1318.313v-89.254l-319.9-221.799l0.073-208.063c0.521-84.662-26.629-121.796-63.961-121.491c-37.332-0.305-64.482,36.829-63.961,121.491l0.073,208.063l-319.9,221.799v89.254l330.343-157.288l12.238,241.308l-134.449,92.931l0.531,42.034l175.125-42.917l175.125,42.917l0.531-42.034l-134.449-92.931l12.238-241.308L1705.06,1318.313z';
    var convertData = function(data) {
        var res = [];
        for (var i = 0; i < data.length; i++) {
            var geoCoord = geoCoordMap[data[i].name];
            if (geoCoord) {
                res.push({
                    name: data[i].name,
                    value: geoCoord.concat(data[i].value),
                    coord: [114.31, 30.52]
                });
            }
        }
        return res;
    };
    var color = ['#a6c84c'];
    var series = [];
    [
        ['广州', data]
    ].forEach(function(item, i) {
        series.push({
                name: '定位',
                type: 'effectScatter',
                coordinateSystem: 'geo',
                showEffectOn: 'render',
                rippleEffect: {
                    brushType: 'stroke'
                },
                hoverAnimation: true,
                itemStyle: {
                    normal: {
                        color: '#0ce928',
                        shadowBlur: 10,
                        shadowColor: '#0ce928',
                    }
                },
                zlevel: 1
            },

            {
                type: 'map',
                map: 'ch',
                zlevel: 0,
                label: {
                    normal: {
                        show: true
                    },
                    emphasis: {
                        textStyle: {
                            color: '#fff'
                        }
                    }
                },
                itemStyle: {
                    normal: {
                        borderColor: 'transparent',
                        color: '#555'
                    }
                },
                width: '30%',
                roam: true,
                selectedMode: 'single',
                data: dt,
                markPoint: {
                    symbol: 'pin',
                    symbolSize: 30,
                    label: {
                        normal: {
                            show: true,
                            formatter: function(d) {
                                return d.name
                            }
                        }
                    },
                    data: [
                        /*从化区*/
                         {
                            name: '24',
                            coord: [113.562891, 23.402281]
                        }, {
                            name: '25',
                            coord: [113.562891, 23.472281]
                        }, {
                            name: '42',
                            coord: [113.662891, 23.592281]
                        }, {
                            name: '43',
                            coord: [113.452891, 23.502281]
                        }, {
                            name: '44',
                            coord: [113.502891, 23.452281]
                        }, {
                            name: '45',
                            coord: [113.562891, 23.592281]
                        },
                        
                        /*花都区*/
                         {
                            name: '26',
                            coord: [113.352891, 23.472281]
                        }, {
                            name: '31',
                            coord: [113.202891, 23.402281]
                        },
                        {
                            name: '41',
                            coord: [113.102891, 23.402281]
                        }, {
                            name: '46',
                            coord: [113.202891, 23.452281]
                        },
                       /* 白云区*/
                        
                        {
                            name: '1',
                            coord: [113.263966, 23.162091]
                        },{
                            name: '3',
                            coord: [113.329866, 23.203551]
                        }, {
                            name: '4',
                            coord: [113.29011, 23.17073]
                        }, {
                            name: '8',
                            coord: [113.362891, 23.252281]
                        }, {
                            name: '9',
                            coord: [113.282891, 23.262281]
                        }, {
                            name: '32',
                            coord: [113.226459, 23.260305]
                        }, {
                            name: '33',
                            coord: [113.316499, 23.291095]
                        }, {
                            name: '34',
                            coord: [113.396499, 23.331095]
                        }, {
                            name: '35',
                            coord: [113.395079, 23.278764]
                        },
                       /* 黄埔区*/
                        {
                            name: '5',
                            coord: [113.562891, 23.182281]
                        }, {
                            name: '6',
                            coord: [113.462891, 23.232281]
                        }, {
                            name: '23',
                            coord: [113.562891, 23.282281]
                        }, {
                            name: '36',
                            coord: [113.432891, 23.202281]
                        }, {
                            name: '38',
                            coord: [113.462891, 23.092281]
                        }, {
                            name: '39',
                            coord: [113.482891, 23.122281]
                        },
                        /*增城区*/
                        {
                            name: '10',
                            coord: [113.802891, 23.282281]
                        }, {
                            name: '11',
                            coord: [113.792891, 23.182281]
                        }, {
                            name: '40',
                            coord: [113.582891, 23.122281]
                        },
                       /* 荔湾区*/
                        {
                            name: '13',
                            coord: [113.202891, 23.072281]
                        }, {
                            name: '14',
                            coord: [113.242891, 23.072281]
                        }, {
                            name: '15',
                            coord: [113.222891, 23.102281]
                        }, {
                            name: '20',
                            coord: [113.222891, 23.122281]
                        },
                        //越秀区
                         {
                            name: '16',
                            coord: [113.282891, 23.122281]
                        }, {
                            name: '17',
                            coord: [113.302891, 23.132281]
                        }, {
                            name: '18',
                            coord: [113.252891, 23.132281]
                        }, {
                            name: '19',
                            coord: [113.272891, 23.122281]
                        },
                        //天河区
                        {
                            name: '2',
                            coord: [113.365079, 23.138764]
                        },  {
                            name: '7',
                            coord: [113.362891, 23.192281]
                        }, {
                            name: '21',
                            coord: [113.352891, 23.122281]
                        },
                        //海珠区
                        {
                            name: '12',
                            coord: [113.282891, 23.082281]
                        },  {
                            name: '22',
                            coord: [113.302891, 23.062281]
                        }, 
                        //番禺区
                        {
                            name: '27',
                            coord: [113.332891, 23.002281]
                        }, {
                            name: '28',
                            coord: [113.382891, 22.952281]
                        },  {
                            name: '37',
                            coord: [113.492891, 23.002281]
                        }, {
                            name: '47',
                            coord: [113.402891, 22.982281]
                        }, {
                            name: '48',
                            coord: [113.442891, 23.052281]
                        },
                        
                        //南沙区
                        {
                            name: '29',
                            coord: [113.442891, 22.802281]
                        }, {
                            name: '30',
                            coord: [113.662891, 22.702281]
                        }, {
                            name: '49',
                            coord: [113.462891, 22.882281]
                        }, {
                            name: '50',
                            coord: [113.402891, 22.872281]
                        },
                    ]
                }
            }
            /*, {
                        name: '点',
                        type: 'scatter',
                        coordinateSystem: 'geo',
                        symbol: 'pin',
                        symbolSize: function(val) {
                            return val[2] / 1;
                        },
                        label: {
                            normal: {
                                show: true,
                                textStyle: {
                                    color: '#000',

                                }
                            }
                        },
                        itemStyle: {
                            normal: {
                                color: '#fff', //标志颜色
                                borderColor: "#fff",
                                borderWidth: 2,
                            },
                            emphasis: {
                                borderColor: '#fff',
                                borderWidth: 2
                            }
                        },
                        zlevel: 6,
                        data: convertData(item[1])
                    }*/
        );
    });

    option = {
        visualMap: { //视觉映射组件
            type: 'piecewise', //分段型。
            splitNumber: 6,
            inverse: true,
            show: false,
            pieces: [{
                min: 1,
                max: 1000,
                color: '#799a1f'
            }, {
                min: 1000,
                max: 2000,
                color: '#149c9c'
            }, {
                min: 2000,
                max: 3000,
                color: '#ff84ff'
            }, {
                min: 3000,
                max: 4000,
                color: '#997cbe'
            }, {
                min: 4000,
                max: 5000,
                color: '#9eb102'
            }, {
                min: 5000,
                max: 6000,
                color: '#b18302'
            }, {
                min: 6000,
                max: 7000,
                color: '#6eb5ed'
            }, {
                min: 7000,
                max: 8000,
                color: '#F9BD5E'
            }, {
                min: 8000,
                max: 9000,
                color: '#F5A115'
            }, {
                min: 9000,
                max: 10000,
                color: '#ED7756'
            }, {
                value: 0,
                label: '正在入库',
                color: '#0ce928'
            }],
            left: 'left',
            top: 'bottom',
            textStyle: {
                color: '#000'
            }
        },

        series: series
    };

    myChart.setOption(option);

}); -->




<!-- var allData = {
    "citys": [{
        "name": "延寿",
        "value": [128.331644, 45.451897, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "临江",
        "value": [126.918087, 41.811979, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "嘉兴",
        "value": [120.755486, 30.746129, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "四平",
        "value": [124.350398, 43.16642, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "营口",
        "value": [122.235418, 40.667012, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "密云",
        "value": [116.801346, 40.35874, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "威海",
        "value": [122.12042, 37.513068, 32],
        "symbolSize": 3,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "杭州",
        "value": [120.15507, 30.274085, 10],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "集安",
        "value": [126.194031, 41.125307, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "贵阳",
        "value": [106.630154, 26.647661, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "抚顺",
        "value": [123.957208, 41.880872, 3],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "海门",
        "value": [121.181615, 31.871173, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "珠海",
        "value": [113.576726, 22.270715, 9],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "河北",
        "value": [114.475704, 38.584854, -19],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "深圳",
        "value": [114.057868, 22.543099, 14],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "黄浦",
        "value": [121.484443, 31.231763, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "蓬莱",
        "value": [120.758848, 37.810661, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "吉林",
        "value": [126.549572, 43.837883, -364],
        "symbolSize": 14,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "甘肃",
        "value": [103.826308, 36.059421, -2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "龙井",
        "value": [129.427066, 42.766311, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "茂名",
        "value": [110.925456, 21.662999, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "丹东",
        "value": [124.354707, 40.0005, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "晋中",
        "value": [112.752695, 37.687024, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "浙江",
        "value": [120.152792, 30.267447, -2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "海城",
        "value": [122.685217, 40.882377, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "溆浦",
        "value": [110.594921, 27.908281, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "北京",
        "value": [116.407526, 39.90403, -14],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "铁岭",
        "value": [123.726166, 42.223769, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "大同",
        "value": [113.61244, 40.040295, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "金坛",
        "value": [119.597897, 31.723247, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "齐齐哈尔",
        "value": [126.661669, 45.742347, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "咸阳",
        "value": [108.708991, 34.329605, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "四川",
        "value": [104.075931, 30.651652, -5],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "福田",
        "value": [114.055036, 22.52153, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "盘锦",
        "value": [122.070714, 41.119997, 3],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "中山",
        "value": [113.392782, 22.517646, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "福建",
        "value": [119.295144, 26.10078, -1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "泰顺",
        "value": [119.717649, 27.556884, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "宝山",
        "value": [131.401589, 46.577167, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "庆安",
        "value": [127.507825, 46.880102, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "海淀",
        "value": [116.298056, 39.959912, 32],
        "symbolSize": 3,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "大兴",
        "value": [116.341395, 39.726929, 3],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "桦川",
        "value": [130.719081, 47.023001, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "惠州",
        "value": [114.416196, 23.111847, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "青岛",
        "value": [120.38264, 36.067082, 52],
        "symbolSize": 3,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "朝阳",
        "value": [116.443108, 39.92147, 17],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "沈阳",
        "value": [123.431475, 41.805698, 41],
        "symbolSize": 3,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "菏泽",
        "value": [115.480656, 35.23375, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "南通",
        "value": [120.894291, 31.980172, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "南充",
        "value": [106.110698, 30.837793, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "双城",
        "value": [126.312745, 45.383263, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "南京",
        "value": [118.796877, 32.060255, 17],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "新疆",
        "value": [87.627704, 43.793026, -2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "成都",
        "value": [104.066541, 30.572269, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "陕西",
        "value": [108.954239, 34.265472, -2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "黄岛",
        "value": [120.04619, 35.872664, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "温州",
        "value": [120.699367, 27.994267, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "石家庄",
        "value": [114.51486, 38.042307, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "邢台",
        "value": [114.504844, 37.070589, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "赣州",
        "value": [114.93503, 25.831829, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "义乌",
        "value": [120.075058, 29.306841, 3],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "南昌",
        "value": [115.858198, 28.682892, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "闵行",
        "value": [121.381709, 31.112813, 18],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "长宁",
        "value": [121.424624, 31.220367, 7],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "道里",
        "value": [126.616957, 45.755777, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "乳山",
        "value": [121.539765, 36.919816, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "双流",
        "value": [103.923648, 30.574473, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "广州",
        "value": [113.264435, 23.129163, 13],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "西城",
        "value": [116.365868, 39.912289, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "佳木斯",
        "value": [130.318917, 46.799923, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "皇姑",
        "value": [123.44197, 41.824796, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "榆树",
        "value": [126.533146, 44.840288, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "临汾",
        "value": [111.518976, 36.088005, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "上海",
        "value": [121.473701, 31.230416, 44],
        "symbolSize": 3,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "内蒙古",
        "value": [111.765618, 40.817498, -23],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "尚志",
        "value": [128.009895, 45.209586, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "湖里",
        "value": [118.146769, 24.512905, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "台州",
        "value": [121.420757, 28.656386, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "潍坊",
        "value": [119.161756, 36.706774, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "苏州",
        "value": [120.585316, 31.298886, 14],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "房山",
        "value": [116.143267, 39.749144, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "即墨",
        "value": [120.447128, 36.389639, 15],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "舒兰",
        "value": [126.965607, 44.406106, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "延吉",
        "value": [129.508946, 42.891255, 3],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "三河",
        "value": [117.078295, 39.982718, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "大连",
        "value": [121.614682, 38.914003, 40],
        "symbolSize": 3,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "辉南",
        "value": [126.046912, 42.684993, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "无锡",
        "value": [120.31191, 31.49117, 14],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "常州",
        "value": [119.973987, 31.810689, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "广西",
        "value": [108.327546, 22.815478, -1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "泉州",
        "value": [118.675676, 24.874132, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "昌平",
        "value": [116.231204, 40.22066, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "海阳",
        "value": [121.158434, 36.776378, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "郑州",
        "value": [113.625368, 34.7466, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "东城",
        "value": [116.416357, 39.928353, 10],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "黄骅",
        "value": [117.330048, 38.371383, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "武侯",
        "value": [104.04339, 30.641982, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "鸡东",
        "value": [131.12408, 45.260412, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "龙口",
        "value": [120.477813, 37.646108, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "汤原",
        "value": [129.905072, 46.730706, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "湖北",
        "value": [114.341862, 30.546498, -4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "克拉玛依",
        "value": [84.889207, 45.579889, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "厦门",
        "value": [118.089425, 24.479834, 3],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "哈尔滨",
        "value": [126.534967, 45.803775, 8],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "秦皇岛",
        "value": [119.600493, 39.935385, 7],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "江苏",
        "value": [118.763232, 32.061707, -1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "常熟",
        "value": [120.752481, 31.654376, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "烟台",
        "value": [121.447935, 37.463822, 24],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "和平",
        "value": [117.21451, 39.116949, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "环翠",
        "value": [122.123444, 37.501991, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "宣武门外东大街",
        "value": [116.378888, 39.899332, 3],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "张家港",
        "value": [120.553284, 31.870367, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "临安",
        "value": [119.724733, 30.233873, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "延安",
        "value": [109.489727, 36.585455, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "天津",
        "value": [117.200983, 39.084158, 28],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "城阳",
        "value": [120.39631, 36.307064, 15],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "石景山",
        "value": [116.222982, 39.906611, 3],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "长沙",
        "value": [112.938814, 28.228209, 5],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "安徽",
        "value": [117.284923, 31.861184, -1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "昆山",
        "value": [120.980737, 31.385598, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "徐汇",
        "value": [121.436525, 31.188523, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "东港",
        "value": [124.152705, 39.863008, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "廊坊",
        "value": [116.683752, 39.538047, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "鞍山",
        "value": [122.994329, 41.108647, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "海陵",
        "value": [119.919425, 32.491016, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "黑龙江",
        "value": [126.661669, 45.742347, -198],
        "symbolSize": 8,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "西藏",
        "value": [91.117212, 29.646923, -1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "河南",
        "value": [113.274379, 34.445122, 0],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "湖南",
        "value": [112.98381, 28.112444, -1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "佛山",
        "value": [113.121416, 23.021548, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "珲春",
        "value": [130.366036, 42.862821, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "扬州",
        "value": [119.412966, 32.39421, 5],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "日照",
        "value": [119.526888, 35.416377, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "唐山",
        "value": [118.180194, 39.630867, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "同江",
        "value": [132.510919, 47.642707, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "荣成",
        "value": [122.486658, 37.16516, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "虎林",
        "value": [132.93721, 45.762686, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "武汉",
        "value": [114.305393, 30.593099, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "合肥",
        "value": [117.227239, 31.820587, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "荆州",
        "value": [112.239741, 30.335165, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "丰台",
        "value": [116.287149, 39.858427, 3],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "山东",
        "value": [117.020359, 36.66853, -6],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "舟山",
        "value": [122.207216, 29.985295, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "连云港",
        "value": [119.221611, 34.596653, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "西安",
        "value": [108.940175, 34.341568, 3],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "济南",
        "value": [117.12, 36.651216, 4],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "绵阳",
        "value": [104.679114, 31.46745, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "辽宁",
        "value": [123.42944, 41.835441, -58],
        "symbolSize": 3,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "山西",
        "value": [112.562398, 37.873532, -3],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#58B3CC"
            }
        }
    }, {
        "name": "呼和浩特",
        "value": [111.749181, 40.842585, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "河西",
        "value": [117.223372, 39.109563, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "兴和",
        "value": [113.834173, 40.872301, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "重庆",
        "value": [106.551557, 29.56301, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "胶州",
        "value": [120.033382, 36.26468, 5],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "宁波",
        "value": [121.550357, 29.874557, 10],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "滨海",
        "value": [119.820831, 33.990334, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "太原",
        "value": [112.548879, 37.87059, 2],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "鸡西",
        "value": [130.969333, 45.295075, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "兰山",
        "value": [118.347707, 35.051729, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "阳泉",
        "value": [113.580519, 37.856972, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "勃利",
        "value": [130.592171, 45.755063, 1],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }, {
        "name": "长春",
        "value": [125.323544, 43.817072, 8],
        "symbolSize": 2,
        "itemStyle": {
            "normal": {
                "color": "#F58158"
            }
        }
    }],
    "moveLines": [{
        "fromName": "黑龙江",
        "toName": "珠海",
        "coords": [
            [126.661669, 45.742347],
            [113.576726, 22.270715]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "舒兰",
        "coords": [
            [126.661669, 45.742347],
            [126.965607, 44.406106]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "大连",
        "coords": [
            [126.661669, 45.742347],
            [121.614682, 38.914003]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "集安",
        "coords": [
            [123.42944, 41.835441],
            [126.194031, 41.125307]
        ]
    }, {
        "fromName": "吉林",
        "toName": "抚顺",
        "coords": [
            [126.549572, 43.837883],
            [123.957208, 41.880872]
        ]
    }, {
        "fromName": "山东",
        "toName": "南京",
        "coords": [
            [117.020359, 36.66853],
            [118.796877, 32.060255]
        ]
    }, {
        "fromName": "北京",
        "toName": "沈阳",
        "coords": [
            [116.407526, 39.90403],
            [123.431475, 41.805698]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "环翠",
        "coords": [
            [126.661669, 45.742347],
            [122.123444, 37.501991]
        ]
    }, {
        "fromName": "天津",
        "toName": "大连",
        "coords": [
            [117.200983, 39.084158],
            [121.614682, 38.914003]
        ]
    }, {
        "fromName": "吉林",
        "toName": "兴和",
        "coords": [
            [126.549572, 43.837883],
            [113.834173, 40.872301]
        ]
    }, {
        "fromName": "河北",
        "toName": "勃利",
        "coords": [
            [114.475704, 38.584854],
            [130.592171, 45.755063]
        ]
    }, {
        "fromName": "吉林",
        "toName": "大连",
        "coords": [
            [126.549572, 43.837883],
            [121.614682, 38.914003]
        ]
    }, {
        "fromName": "吉林",
        "toName": "沈阳",
        "coords": [
            [126.549572, 43.837883],
            [123.431475, 41.805698]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "闵行",
        "coords": [
            [126.661669, 45.742347],
            [121.381709, 31.112813]
        ]
    }, {
        "fromName": "天津",
        "toName": "朝阳",
        "coords": [
            [117.200983, 39.084158],
            [116.443108, 39.92147]
        ]
    }, {
        "fromName": "吉林",
        "toName": "黄岛",
        "coords": [
            [126.549572, 43.837883],
            [120.04619, 35.872664]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "上海",
        "coords": [
            [111.765618, 40.817498],
            [121.473701, 31.230416]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "南京",
        "coords": [
            [111.765618, 40.817498],
            [118.796877, 32.060255]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "杭州",
        "coords": [
            [123.42944, 41.835441],
            [120.15507, 30.274085]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "海城",
        "coords": [
            [126.661669, 45.742347],
            [122.685217, 40.882377]
        ]
    }, {
        "fromName": "吉林",
        "toName": "西城",
        "coords": [
            [126.549572, 43.837883],
            [116.365868, 39.912289]
        ]
    }, {
        "fromName": "四川",
        "toName": "上海",
        "coords": [
            [104.075931, 30.651652],
            [121.473701, 31.230416]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "西城",
        "coords": [
            [126.661669, 45.742347],
            [116.365868, 39.912289]
        ]
    }, {
        "fromName": "吉林",
        "toName": "丹东",
        "coords": [
            [126.549572, 43.837883],
            [124.354707, 40.0005]
        ]
    }, {
        "fromName": "吉林",
        "toName": "宁波",
        "coords": [
            [126.549572, 43.837883],
            [121.550357, 29.874557]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "海淀",
        "coords": [
            [123.42944, 41.835441],
            [116.298056, 39.959912]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "青岛",
        "coords": [
            [123.42944, 41.835441],
            [120.38264, 36.067082]
        ]
    }, {
        "fromName": "吉林",
        "toName": "苏州",
        "coords": [
            [126.549572, 43.837883],
            [120.585316, 31.298886]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "抚顺",
        "coords": [
            [126.661669, 45.742347],
            [123.957208, 41.880872]
        ]
    }, {
        "fromName": "吉林",
        "toName": "临安",
        "coords": [
            [126.549572, 43.837883],
            [119.724733, 30.233873]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "烟台",
        "coords": [
            [123.42944, 41.835441],
            [121.447935, 37.463822]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "海淀",
        "coords": [
            [126.661669, 45.742347],
            [116.298056, 39.959912]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "南昌",
        "coords": [
            [126.661669, 45.742347],
            [115.858198, 28.682892]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "沈阳",
        "coords": [
            [111.765618, 40.817498],
            [123.431475, 41.805698]
        ]
    }, {
        "fromName": "山西",
        "toName": "城阳",
        "coords": [
            [112.562398, 37.873532],
            [120.39631, 36.307064]
        ]
    }, {
        "fromName": "吉林",
        "toName": "广州",
        "coords": [
            [126.549572, 43.837883],
            [113.264435, 23.129163]
        ]
    }, {
        "fromName": "上海",
        "toName": "沈阳",
        "coords": [
            [121.473701, 31.230416],
            [123.431475, 41.805698]
        ]
    }, {
        "fromName": "四川",
        "toName": "阳泉",
        "coords": [
            [104.075931, 30.651652],
            [113.580519, 37.856972]
        ]
    }, {
        "fromName": "河北",
        "toName": "桦川",
        "coords": [
            [114.475704, 38.584854],
            [130.719081, 47.023001]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "海淀",
        "coords": [
            [111.765618, 40.817498],
            [116.298056, 39.959912]
        ]
    }, {
        "fromName": "安徽",
        "toName": "河北",
        "coords": [
            [117.284923, 31.861184],
            [114.475704, 38.584854]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "呼和浩特",
        "coords": [
            [123.42944, 41.835441],
            [111.749181, 40.842585]
        ]
    }, {
        "fromName": "广西",
        "toName": "茂名",
        "coords": [
            [108.327546, 22.815478],
            [110.925456, 21.662999]
        ]
    }, {
        "fromName": "吉林",
        "toName": "东城",
        "coords": [
            [126.549572, 43.837883],
            [116.416357, 39.928353]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "盘锦",
        "coords": [
            [111.765618, 40.817498],
            [122.070714, 41.119997]
        ]
    }, {
        "fromName": "山东",
        "toName": "哈尔滨",
        "coords": [
            [117.020359, 36.66853],
            [126.534967, 45.803775]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "沈阳",
        "coords": [
            [126.661669, 45.742347],
            [123.431475, 41.805698]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "丰台",
        "coords": [
            [126.661669, 45.742347],
            [116.287149, 39.858427]
        ]
    }, {
        "fromName": "四川",
        "toName": "盘锦",
        "coords": [
            [104.075931, 30.651652],
            [122.070714, 41.119997]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "皇姑",
        "coords": [
            [126.661669, 45.742347],
            [123.44197, 41.824796]
        ]
    }, {
        "fromName": "河北",
        "toName": "虎林",
        "coords": [
            [114.475704, 38.584854],
            [132.93721, 45.762686]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "宝山",
        "coords": [
            [123.42944, 41.835441],
            [131.401589, 46.577167]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "吉林",
        "coords": [
            [126.661669, 45.742347],
            [126.549572, 43.837883]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "青岛",
        "coords": [
            [126.661669, 45.742347],
            [120.38264, 36.067082]
        ]
    }, {
        "fromName": "吉林",
        "toName": "烟台",
        "coords": [
            [126.549572, 43.837883],
            [121.447935, 37.463822]
        ]
    }, {
        "fromName": "山东",
        "toName": "临江",
        "coords": [
            [117.020359, 36.66853],
            [126.918087, 41.811979]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "黄岛",
        "coords": [
            [126.661669, 45.742347],
            [120.04619, 35.872664]
        ]
    }, {
        "fromName": "吉林",
        "toName": "石家庄",
        "coords": [
            [126.549572, 43.837883],
            [114.51486, 38.042307]
        ]
    }, {
        "fromName": "吉林",
        "toName": "汤原",
        "coords": [
            [126.549572, 43.837883],
            [129.905072, 46.730706]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "临江",
        "coords": [
            [126.661669, 45.742347],
            [126.918087, 41.811979]
        ]
    }, {
        "fromName": "吉林",
        "toName": "济南",
        "coords": [
            [126.549572, 43.837883],
            [117.12, 36.651216]
        ]
    }, {
        "fromName": "吉林",
        "toName": "太原",
        "coords": [
            [126.549572, 43.837883],
            [112.548879, 37.87059]
        ]
    }, {
        "fromName": "吉林",
        "toName": "威海",
        "coords": [
            [126.549572, 43.837883],
            [122.12042, 37.513068]
        ]
    }, {
        "fromName": "湖北",
        "toName": "深圳",
        "coords": [
            [114.341862, 30.546498],
            [114.057868, 22.543099]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "荣成",
        "coords": [
            [111.765618, 40.817498],
            [122.486658, 37.16516]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "郑州",
        "coords": [
            [123.42944, 41.835441],
            [113.625368, 34.7466]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "朝阳",
        "coords": [
            [126.661669, 45.742347],
            [116.443108, 39.92147]
        ]
    }, {
        "fromName": "吉林",
        "toName": "昆山",
        "coords": [
            [126.549572, 43.837883],
            [120.980737, 31.385598]
        ]
    }, {
        "fromName": "吉林",
        "toName": "双城",
        "coords": [
            [126.549572, 43.837883],
            [126.312745, 45.383263]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "克拉玛依",
        "coords": [
            [126.661669, 45.742347],
            [84.889207, 45.579889]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "上海",
        "coords": [
            [123.42944, 41.835441],
            [121.473701, 31.230416]
        ]
    }, {
        "fromName": "吉林",
        "toName": "海阳",
        "coords": [
            [126.549572, 43.837883],
            [121.158434, 36.776378]
        ]
    }, {
        "fromName": "吉林",
        "toName": "宣武门外东大街",
        "coords": [
            [126.549572, 43.837883],
            [116.378888, 39.899332]
        ]
    }, {
        "fromName": "山东",
        "toName": "海淀",
        "coords": [
            [117.020359, 36.66853],
            [116.298056, 39.959912]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "威海",
        "coords": [
            [111.765618, 40.817498],
            [122.12042, 37.513068]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "晋中",
        "coords": [
            [126.661669, 45.742347],
            [112.752695, 37.687024]
        ]
    }, {
        "fromName": "西藏",
        "toName": "广州",
        "coords": [
            [91.117212, 29.646923],
            [113.264435, 23.129163]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "无锡",
        "coords": [
            [123.42944, 41.835441],
            [120.31191, 31.49117]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "城阳",
        "coords": [
            [126.661669, 45.742347],
            [120.39631, 36.307064]
        ]
    }, {
        "fromName": "河北",
        "toName": "丰台",
        "coords": [
            [114.475704, 38.584854],
            [116.287149, 39.858427]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "扬州",
        "coords": [
            [126.661669, 45.742347],
            [119.412966, 32.39421]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "天津",
        "coords": [
            [123.42944, 41.835441],
            [117.200983, 39.084158]
        ]
    }, {
        "fromName": "吉林",
        "toName": "扬州",
        "coords": [
            [126.549572, 43.837883],
            [119.412966, 32.39421]
        ]
    }, {
        "fromName": "吉林",
        "toName": "嘉兴",
        "coords": [
            [126.549572, 43.837883],
            [120.755486, 30.746129]
        ]
    }, {
        "fromName": "河北",
        "toName": "延寿",
        "coords": [
            [114.475704, 38.584854],
            [128.331644, 45.451897]
        ]
    }, {
        "fromName": "吉林",
        "toName": "义乌",
        "coords": [
            [126.549572, 43.837883],
            [120.075058, 29.306841]
        ]
    }, {
        "fromName": "吉林",
        "toName": "张家港",
        "coords": [
            [126.549572, 43.837883],
            [120.553284, 31.870367]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "贵阳",
        "coords": [
            [123.42944, 41.835441],
            [106.630154, 26.647661]
        ]
    }, {
        "fromName": "吉林",
        "toName": "辽宁",
        "coords": [
            [126.549572, 43.837883],
            [123.42944, 41.835441]
        ]
    }, {
        "fromName": "河南",
        "toName": "营口",
        "coords": [
            [113.274379, 34.445122],
            [122.235418, 40.667012]
        ]
    }, {
        "fromName": "吉林",
        "toName": "合肥",
        "coords": [
            [126.549572, 43.837883],
            [117.227239, 31.820587]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "苏州",
        "coords": [
            [126.661669, 45.742347],
            [120.585316, 31.298886]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "榆树",
        "coords": [
            [126.661669, 45.742347],
            [126.533146, 44.840288]
        ]
    }, {
        "fromName": "吉林",
        "toName": "常熟",
        "coords": [
            [126.549572, 43.837883],
            [120.752481, 31.654376]
        ]
    }, {
        "fromName": "吉林",
        "toName": "乳山",
        "coords": [
            [126.549572, 43.837883],
            [121.539765, 36.919816]
        ]
    }, {
        "fromName": "四川",
        "toName": "青岛",
        "coords": [
            [104.075931, 30.651652],
            [120.38264, 36.067082]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "深圳",
        "coords": [
            [126.661669, 45.742347],
            [114.057868, 22.543099]
        ]
    }, {
        "fromName": "天津",
        "toName": "东城",
        "coords": [
            [117.200983, 39.084158],
            [116.416357, 39.928353]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "上海",
        "coords": [
            [126.661669, 45.742347],
            [121.473701, 31.230416]
        ]
    }, {
        "fromName": "天津",
        "toName": "宁波",
        "coords": [
            [117.200983, 39.084158],
            [121.550357, 29.874557]
        ]
    }, {
        "fromName": "吉林",
        "toName": "海门",
        "coords": [
            [126.549572, 43.837883],
            [121.181615, 31.871173]
        ]
    }, {
        "fromName": "山西",
        "toName": "沈阳",
        "coords": [
            [112.562398, 37.873532],
            [123.431475, 41.805698]
        ]
    }, {
        "fromName": "吉林",
        "toName": "成都",
        "coords": [
            [126.549572, 43.837883],
            [104.066541, 30.572269]
        ]
    }, {
        "fromName": "吉林",
        "toName": "南昌",
        "coords": [
            [126.549572, 43.837883],
            [115.858198, 28.682892]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "常州",
        "coords": [
            [126.661669, 45.742347],
            [119.973987, 31.810689]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "兰山",
        "coords": [
            [111.765618, 40.817498],
            [118.347707, 35.051729]
        ]
    }, {
        "fromName": "吉林",
        "toName": "河南",
        "coords": [
            [126.549572, 43.837883],
            [113.274379, 34.445122]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "福田",
        "coords": [
            [126.661669, 45.742347],
            [114.055036, 22.52153]
        ]
    }, {
        "fromName": "吉林",
        "toName": "常州",
        "coords": [
            [126.549572, 43.837883],
            [119.973987, 31.810689]
        ]
    }, {
        "fromName": "吉林",
        "toName": "双流",
        "coords": [
            [126.549572, 43.837883],
            [103.923648, 30.574473]
        ]
    }, {
        "fromName": "吉林",
        "toName": "潍坊",
        "coords": [
            [126.549572, 43.837883],
            [119.161756, 36.706774]
        ]
    }, {
        "fromName": "吉林",
        "toName": "延安",
        "coords": [
            [126.549572, 43.837883],
            [109.489727, 36.585455]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "长春",
        "coords": [
            [123.42944, 41.835441],
            [125.323544, 43.817072]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "南京",
        "coords": [
            [126.661669, 45.742347],
            [118.796877, 32.060255]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "和平",
        "coords": [
            [123.42944, 41.835441],
            [117.21451, 39.116949]
        ]
    }, {
        "fromName": "北京",
        "toName": "哈尔滨",
        "coords": [
            [116.407526, 39.90403],
            [126.534967, 45.803775]
        ]
    }, {
        "fromName": "吉林",
        "toName": "武汉",
        "coords": [
            [126.549572, 43.837883],
            [114.305393, 30.593099]
        ]
    }, {
        "fromName": "吉林",
        "toName": "海陵",
        "coords": [
            [126.549572, 43.837883],
            [119.919425, 32.491016]
        ]
    }, {
        "fromName": "吉林",
        "toName": "日照",
        "coords": [
            [126.549572, 43.837883],
            [119.526888, 35.416377]
        ]
    }, {
        "fromName": "吉林",
        "toName": "台州",
        "coords": [
            [126.549572, 43.837883],
            [121.420757, 28.656386]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "厦门",
        "coords": [
            [123.42944, 41.835441],
            [118.089425, 24.479834]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "贵阳",
        "coords": [
            [126.661669, 45.742347],
            [106.630154, 26.647661]
        ]
    }, {
        "fromName": "吉林",
        "toName": "鞍山",
        "coords": [
            [126.549572, 43.837883],
            [122.994329, 41.108647]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "荣成",
        "coords": [
            [123.42944, 41.835441],
            [122.486658, 37.16516]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "天津",
        "coords": [
            [126.661669, 45.742347],
            [117.200983, 39.084158]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "河西",
        "coords": [
            [126.661669, 45.742347],
            [117.223372, 39.109563]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "秦皇岛",
        "coords": [
            [126.661669, 45.742347],
            [119.600493, 39.935385]
        ]
    }, {
        "fromName": "吉林",
        "toName": "荆州",
        "coords": [
            [126.549572, 43.837883],
            [112.239741, 30.335165]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "东城",
        "coords": [
            [126.661669, 45.742347],
            [116.416357, 39.928353]
        ]
    }, {
        "fromName": "吉林",
        "toName": "即墨",
        "coords": [
            [126.549572, 43.837883],
            [120.447128, 36.389639]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "西城",
        "coords": [
            [123.42944, 41.835441],
            [116.365868, 39.912289]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "大兴",
        "coords": [
            [126.661669, 45.742347],
            [116.341395, 39.726929]
        ]
    }, {
        "fromName": "河北",
        "toName": "哈尔滨",
        "coords": [
            [114.475704, 38.584854],
            [126.534967, 45.803775]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "江苏",
        "coords": [
            [126.661669, 45.742347],
            [118.763232, 32.061707]
        ]
    }, {
        "fromName": "吉林",
        "toName": "和平",
        "coords": [
            [126.549572, 43.837883],
            [117.21451, 39.116949]
        ]
    }, {
        "fromName": "江苏",
        "toName": "鸡东",
        "coords": [
            [118.763232, 32.061707],
            [131.12408, 45.260412]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "辉南",
        "coords": [
            [123.42944, 41.835441],
            [126.046912, 42.684993]
        ]
    }, {
        "fromName": "吉林",
        "toName": "深圳",
        "coords": [
            [126.549572, 43.837883],
            [114.057868, 22.543099]
        ]
    }, {
        "fromName": "福建",
        "toName": "泰顺",
        "coords": [
            [119.295144, 26.10078],
            [119.717649, 27.556884]
        ]
    }, {
        "fromName": "上海",
        "toName": "深圳",
        "coords": [
            [121.473701, 31.230416],
            [114.057868, 22.543099]
        ]
    }, {
        "fromName": "吉林",
        "toName": "秦皇岛",
        "coords": [
            [126.549572, 43.837883],
            [119.600493, 39.935385]
        ]
    }, {
        "fromName": "吉林",
        "toName": "徐汇",
        "coords": [
            [126.549572, 43.837883],
            [121.436525, 31.188523]
        ]
    }, {
        "fromName": "吉林",
        "toName": "石景山",
        "coords": [
            [126.549572, 43.837883],
            [116.222982, 39.906611]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "城阳",
        "coords": [
            [123.42944, 41.835441],
            [120.39631, 36.307064]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "威海",
        "coords": [
            [126.661669, 45.742347],
            [122.12042, 37.513068]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "惠州",
        "coords": [
            [126.661669, 45.742347],
            [114.416196, 23.111847]
        ]
    }, {
        "fromName": "吉林",
        "toName": "龙口",
        "coords": [
            [126.549572, 43.837883],
            [120.477813, 37.646108]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "四平",
        "coords": [
            [126.661669, 45.742347],
            [124.350398, 43.16642]
        ]
    }, {
        "fromName": "吉林",
        "toName": "南充",
        "coords": [
            [126.549572, 43.837883],
            [106.110698, 30.837793]
        ]
    }, {
        "fromName": "河北",
        "toName": "东港",
        "coords": [
            [114.475704, 38.584854],
            [124.152705, 39.863008]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "西安",
        "coords": [
            [123.42944, 41.835441],
            [108.940175, 34.341568]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "滨海",
        "coords": [
            [111.765618, 40.817498],
            [119.820831, 33.990334]
        ]
    }, {
        "fromName": "河南",
        "toName": "青岛",
        "coords": [
            [113.274379, 34.445122],
            [120.38264, 36.067082]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "昆山",
        "coords": [
            [126.661669, 45.742347],
            [120.980737, 31.385598]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "长沙",
        "coords": [
            [123.42944, 41.835441],
            [112.938814, 28.228209]
        ]
    }, {
        "fromName": "吉林",
        "toName": "哈尔滨",
        "coords": [
            [126.549572, 43.837883],
            [126.534967, 45.803775]
        ]
    }, {
        "fromName": "河北",
        "toName": "尚志",
        "coords": [
            [114.475704, 38.584854],
            [128.009895, 45.209586]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "东城",
        "coords": [
            [123.42944, 41.835441],
            [116.416357, 39.928353]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "珠海",
        "coords": [
            [123.42944, 41.835441],
            [113.576726, 22.270715]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "铁岭",
        "coords": [
            [126.661669, 45.742347],
            [123.726166, 42.223769]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "蓬莱",
        "coords": [
            [126.661669, 45.742347],
            [120.758848, 37.810661]
        ]
    }, {
        "fromName": "北京",
        "toName": "天津",
        "coords": [
            [116.407526, 39.90403],
            [117.200983, 39.084158]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "天津",
        "coords": [
            [111.765618, 40.817498],
            [117.200983, 39.084158]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "宁波",
        "coords": [
            [126.661669, 45.742347],
            [121.550357, 29.874557]
        ]
    }, {
        "fromName": "吉林",
        "toName": "上海",
        "coords": [
            [126.549572, 43.837883],
            [121.473701, 31.230416]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "佛山",
        "coords": [
            [123.42944, 41.835441],
            [113.121416, 23.021548]
        ]
    }, {
        "fromName": "吉林",
        "toName": "长宁",
        "coords": [
            [126.549572, 43.837883],
            [121.424624, 31.220367]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "珲春",
        "coords": [
            [126.661669, 45.742347],
            [130.366036, 42.862821]
        ]
    }, {
        "fromName": "山东",
        "toName": "黄浦",
        "coords": [
            [117.020359, 36.66853],
            [121.484443, 31.231763]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "威海",
        "coords": [
            [123.42944, 41.835441],
            [122.12042, 37.513068]
        ]
    }, {
        "fromName": "天津",
        "toName": "长春",
        "coords": [
            [117.200983, 39.084158],
            [125.323544, 43.817072]
        ]
    }, {
        "fromName": "新疆",
        "toName": "上海",
        "coords": [
            [87.627704, 43.793026],
            [121.473701, 31.230416]
        ]
    }, {
        "fromName": "河北",
        "toName": "鸡西",
        "coords": [
            [114.475704, 38.584854],
            [130.969333, 45.295075]
        ]
    }, {
        "fromName": "陕西",
        "toName": "呼和浩特",
        "coords": [
            [108.954239, 34.265472],
            [111.749181, 40.842585]
        ]
    }, {
        "fromName": "吉林",
        "toName": "连云港",
        "coords": [
            [126.549572, 43.837883],
            [119.221611, 34.596653]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "杭州",
        "coords": [
            [126.661669, 45.742347],
            [120.15507, 30.274085]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "嘉兴",
        "coords": [
            [126.661669, 45.742347],
            [120.755486, 30.746129]
        ]
    }, {
        "fromName": "陕西",
        "toName": "盘锦",
        "coords": [
            [108.954239, 34.265472],
            [122.070714, 41.119997]
        ]
    }, {
        "fromName": "河北",
        "toName": "同江",
        "coords": [
            [114.475704, 38.584854],
            [132.510919, 47.642707]
        ]
    }, {
        "fromName": "吉林",
        "toName": "杭州",
        "coords": [
            [126.549572, 43.837883],
            [120.15507, 30.274085]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "舟山",
        "coords": [
            [126.661669, 45.742347],
            [122.207216, 29.985295]
        ]
    }, {
        "fromName": "河南",
        "toName": "大连",
        "coords": [
            [113.274379, 34.445122],
            [121.614682, 38.914003]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "绵阳",
        "coords": [
            [123.42944, 41.835441],
            [104.679114, 31.46745]
        ]
    }, {
        "fromName": "吉林",
        "toName": "溆浦",
        "coords": [
            [126.549572, 43.837883],
            [110.594921, 27.908281]
        ]
    }, {
        "fromName": "吉林",
        "toName": "朝阳",
        "coords": [
            [126.549572, 43.837883],
            [116.443108, 39.92147]
        ]
    }, {
        "fromName": "吉林",
        "toName": "无锡",
        "coords": [
            [126.549572, 43.837883],
            [120.31191, 31.49117]
        ]
    }, {
        "fromName": "浙江",
        "toName": "沈阳",
        "coords": [
            [120.152792, 30.267447],
            [123.431475, 41.805698]
        ]
    }, {
        "fromName": "吉林",
        "toName": "湖里",
        "coords": [
            [126.549572, 43.837883],
            [118.146769, 24.512905]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "无锡",
        "coords": [
            [126.661669, 45.742347],
            [120.31191, 31.49117]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "长宁",
        "coords": [
            [126.661669, 45.742347],
            [121.424624, 31.220367]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "胶州",
        "coords": [
            [123.42944, 41.835441],
            [120.033382, 36.26468]
        ]
    }, {
        "fromName": "吉林",
        "toName": "青岛",
        "coords": [
            [126.549572, 43.837883],
            [120.38264, 36.067082]
        ]
    }, {
        "fromName": "河北",
        "toName": "海淀",
        "coords": [
            [114.475704, 38.584854],
            [116.298056, 39.959912]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "厦门",
        "coords": [
            [126.661669, 45.742347],
            [118.089425, 24.479834]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "中山",
        "coords": [
            [126.661669, 45.742347],
            [113.392782, 22.517646]
        ]
    }, {
        "fromName": "河北",
        "toName": "太原",
        "coords": [
            [114.475704, 38.584854],
            [112.548879, 37.87059]
        ]
    }, {
        "fromName": "新疆",
        "toName": "吉林",
        "coords": [
            [87.627704, 43.793026],
            [126.549572, 43.837883]
        ]
    }, {
        "fromName": "吉林",
        "toName": "武侯",
        "coords": [
            [126.549572, 43.837883],
            [104.04339, 30.641982]
        ]
    }, {
        "fromName": "北京",
        "toName": "廊坊",
        "coords": [
            [116.407526, 39.90403],
            [116.683752, 39.538047]
        ]
    }, {
        "fromName": "浙江",
        "toName": "临汾",
        "coords": [
            [120.152792, 30.267447],
            [111.518976, 36.088005]
        ]
    }, {
        "fromName": "湖北",
        "toName": "天津",
        "coords": [
            [114.341862, 30.546498],
            [117.200983, 39.084158]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "泉州",
        "coords": [
            [126.661669, 45.742347],
            [118.675676, 24.874132]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "温州",
        "coords": [
            [126.661669, 45.742347],
            [120.699367, 27.994267]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "唐山",
        "coords": [
            [126.661669, 45.742347],
            [118.180194, 39.630867]
        ]
    }, {
        "fromName": "北京",
        "toName": "铁岭",
        "coords": [
            [116.407526, 39.90403],
            [123.726166, 42.223769]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "即墨",
        "coords": [
            [123.42944, 41.835441],
            [120.447128, 36.389639]
        ]
    }, {
        "fromName": "北京",
        "toName": "上海",
        "coords": [
            [116.407526, 39.90403],
            [121.473701, 31.230416]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "广州",
        "coords": [
            [126.661669, 45.742347],
            [113.264435, 23.129163]
        ]
    }, {
        "fromName": "吉林",
        "toName": "廊坊",
        "coords": [
            [126.549572, 43.837883],
            [116.683752, 39.538047]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "荣成",
        "coords": [
            [126.661669, 45.742347],
            [122.486658, 37.16516]
        ]
    }, {
        "fromName": "吉林",
        "toName": "海城",
        "coords": [
            [126.549572, 43.837883],
            [122.685217, 40.882377]
        ]
    }, {
        "fromName": "湖南",
        "toName": "沈阳",
        "coords": [
            [112.98381, 28.112444],
            [123.431475, 41.805698]
        ]
    }, {
        "fromName": "北京",
        "toName": "青岛",
        "coords": [
            [116.407526, 39.90403],
            [120.38264, 36.067082]
        ]
    }, {
        "fromName": "河北",
        "toName": "大连",
        "coords": [
            [114.475704, 38.584854],
            [121.614682, 38.914003]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "珠海",
        "coords": [
            [111.765618, 40.817498],
            [113.576726, 22.270715]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "房山",
        "coords": [
            [126.661669, 45.742347],
            [116.143267, 39.749144]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "金坛",
        "coords": [
            [126.661669, 45.742347],
            [119.597897, 31.723247]
        ]
    }, {
        "fromName": "河北",
        "toName": "齐齐哈尔",
        "coords": [
            [114.475704, 38.584854],
            [126.661669, 45.742347]
        ]
    }, {
        "fromName": "吉林",
        "toName": "大兴",
        "coords": [
            [126.549572, 43.837883],
            [116.341395, 39.726929]
        ]
    }, {
        "fromName": "吉林",
        "toName": "密云",
        "coords": [
            [126.549572, 43.837883],
            [116.801346, 40.35874]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "和平",
        "coords": [
            [126.661669, 45.742347],
            [117.21451, 39.116949]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "龙井",
        "coords": [
            [111.765618, 40.817498],
            [129.427066, 42.766311]
        ]
    }, {
        "fromName": "吉林",
        "toName": "道里",
        "coords": [
            [126.549572, 43.837883],
            [126.616957, 45.755777]
        ]
    }, {
        "fromName": "山东",
        "toName": "武汉",
        "coords": [
            [117.020359, 36.66853],
            [114.305393, 30.593099]
        ]
    }, {
        "fromName": "甘肃",
        "toName": "常熟",
        "coords": [
            [103.826308, 36.059421],
            [120.752481, 31.654376]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "烟台",
        "coords": [
            [126.661669, 45.742347],
            [121.447935, 37.463822]
        ]
    }, {
        "fromName": "吉林",
        "toName": "海淀",
        "coords": [
            [126.549572, 43.837883],
            [116.298056, 39.959912]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "长沙",
        "coords": [
            [126.661669, 45.742347],
            [112.938814, 28.228209]
        ]
    }, {
        "fromName": "天津",
        "toName": "石家庄",
        "coords": [
            [117.200983, 39.084158],
            [114.51486, 38.042307]
        ]
    }, {
        "fromName": "吉林",
        "toName": "佛山",
        "coords": [
            [126.549572, 43.837883],
            [113.121416, 23.021548]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "黄骅",
        "coords": [
            [123.42944, 41.835441],
            [117.330048, 38.371383]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "中山",
        "coords": [
            [111.765618, 40.817498],
            [113.392782, 22.517646]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "北京",
        "coords": [
            [126.661669, 45.742347],
            [116.407526, 39.90403]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "三河",
        "coords": [
            [126.661669, 45.742347],
            [117.078295, 39.982718]
        ]
    }, {
        "fromName": "河北",
        "toName": "庆安",
        "coords": [
            [114.475704, 38.584854],
            [127.507825, 46.880102]
        ]
    }, {
        "fromName": "吉林",
        "toName": "长沙",
        "coords": [
            [126.549572, 43.837883],
            [112.938814, 28.228209]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "西安",
        "coords": [
            [126.661669, 45.742347],
            [108.940175, 34.341568]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "朝阳",
        "coords": [
            [111.765618, 40.817498],
            [116.443108, 39.92147]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "丰台",
        "coords": [
            [123.42944, 41.835441],
            [116.287149, 39.858427]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "延吉",
        "coords": [
            [126.661669, 45.742347],
            [129.508946, 42.891255]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "长春",
        "coords": [
            [126.661669, 45.742347],
            [125.323544, 43.817072]
        ]
    }, {
        "fromName": "吉林",
        "toName": "天津",
        "coords": [
            [126.549572, 43.837883],
            [117.200983, 39.084158]
        ]
    }, {
        "fromName": "吉林",
        "toName": "昌平",
        "coords": [
            [126.549572, 43.837883],
            [116.231204, 40.22066]
        ]
    }, {
        "fromName": "吉林",
        "toName": "赣州",
        "coords": [
            [126.549572, 43.837883],
            [114.93503, 25.831829]
        ]
    }, {
        "fromName": "吉林",
        "toName": "厦门",
        "coords": [
            [126.549572, 43.837883],
            [118.089425, 24.479834]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "秦皇岛",
        "coords": [
            [111.765618, 40.817498],
            [119.600493, 39.935385]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "菏泽",
        "coords": [
            [111.765618, 40.817498],
            [115.480656, 35.23375]
        ]
    }, {
        "fromName": "吉林",
        "toName": "闵行",
        "coords": [
            [126.549572, 43.837883],
            [121.381709, 31.112813]
        ]
    }, {
        "fromName": "辽宁",
        "toName": "石景山",
        "coords": [
            [123.42944, 41.835441],
            [116.222982, 39.906611]
        ]
    }, {
        "fromName": "吉林",
        "toName": "珠海",
        "coords": [
            [126.549572, 43.837883],
            [113.576726, 22.270715]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "青岛",
        "coords": [
            [111.765618, 40.817498],
            [120.38264, 36.067082]
        ]
    }, {
        "fromName": "北京",
        "toName": "海门",
        "coords": [
            [116.407526, 39.90403],
            [121.181615, 31.871173]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "长春",
        "coords": [
            [111.765618, 40.817498],
            [125.323544, 43.817072]
        ]
    }, {
        "fromName": "吉林",
        "toName": "城阳",
        "coords": [
            [126.549572, 43.837883],
            [120.39631, 36.307064]
        ]
    }, {
        "fromName": "吉林",
        "toName": "大同",
        "coords": [
            [126.549572, 43.837883],
            [113.61244, 40.040295]
        ]
    }, {
        "fromName": "湖北",
        "toName": "邢台",
        "coords": [
            [114.341862, 30.546498],
            [114.504844, 37.070589]
        ]
    }, {
        "fromName": "吉林",
        "toName": "胶州",
        "coords": [
            [126.549572, 43.837883],
            [120.033382, 36.26468]
        ]
    }, {
        "fromName": "吉林",
        "toName": "重庆",
        "coords": [
            [126.549572, 43.837883],
            [106.551557, 29.56301]
        ]
    }, {
        "fromName": "河北",
        "toName": "佳木斯",
        "coords": [
            [114.475704, 38.584854],
            [130.318917, 46.799923]
        ]
    }, {
        "fromName": "甘肃",
        "toName": "大连",
        "coords": [
            [103.826308, 36.059421],
            [121.614682, 38.914003]
        ]
    }, {
        "fromName": "吉林",
        "toName": "南京",
        "coords": [
            [126.549572, 43.837883],
            [118.796877, 32.060255]
        ]
    }, {
        "fromName": "内蒙古",
        "toName": "日照",
        "coords": [
            [111.765618, 40.817498],
            [119.526888, 35.416377]
        ]
    }, {
        "fromName": "吉林",
        "toName": "鸡东",
        "coords": [
            [126.549572, 43.837883],
            [131.12408, 45.260412]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "即墨",
        "coords": [
            [126.661669, 45.742347],
            [120.447128, 36.389639]
        ]
    }, {
        "fromName": "江苏",
        "toName": "朝阳",
        "coords": [
            [118.763232, 32.061707],
            [116.443108, 39.92147]
        ]
    }, {
        "fromName": "吉林",
        "toName": "南通",
        "coords": [
            [126.549572, 43.837883],
            [120.894291, 31.980172]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "张家港",
        "coords": [
            [126.661669, 45.742347],
            [120.553284, 31.870367]
        ]
    }, {
        "fromName": "吉林",
        "toName": "三河",
        "coords": [
            [126.549572, 43.837883],
            [117.078295, 39.982718]
        ]
    }, {
        "fromName": "吉林",
        "toName": "咸阳",
        "coords": [
            [126.549572, 43.837883],
            [108.708991, 34.329605]
        ]
    }, {
        "fromName": "吉林",
        "toName": "中山",
        "coords": [
            [126.549572, 43.837883],
            [113.392782, 22.517646]
        ]
    }, {
        "fromName": "黑龙江",
        "toName": "胶州",
        "coords": [
            [126.661669, 45.742347],
            [120.033382, 36.26468]
        ]
    }]
};

option = {
    backgroundColor: '#404a59',
    title: {
        text: '朴姓人口迁徙图',
        left: 'center',
        textStyle: {
            color: '#fff'
        }
    },
    legend: {
        show: false,
        orient: 'vertical',
        top: 'bottom',
        left: 'right',
        data: ['地点', '线路'],
        textStyle: {
            color: '#fff'
        }
    },
    geo: {
        map: 'china',
        label: {
            emphasis: {
                show: false
            }
        },
        roam: true,
        itemStyle: {
            normal: {
                areaColor: '#323c48',
                borderColor: '#404a59'
            },
            emphasis: {
                areaColor: '#2a333d'
            }
        }
    },
    series: [{
        name: '地点',
        type: 'effectScatter',
        coordinateSystem: 'geo',
        zlevel: 2,
        rippleEffect: {
            brushType: 'stroke'
        },
        label: {
            emphasis: {
                show: true,
                position: 'right',
                formatter: '{b}'
            }
        },
        symbolSize: 2,
        showEffectOn: 'render',
        itemStyle: {
            normal: {
                color: '#46bee9'
            }
        },
        data: allData.citys
    }, {
        name: '线路',
        type: 'lines',
        coordinateSystem: 'geo',
        zlevel: 2,
        large: true,
        effect: {
            show: true,
            constantSpeed: 30,
            symbol: 'pin',
            symbolSize: 3,
            trailLength: 0,
        },
        lineStyle: {
            normal: {
                color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
                    offset: 0,
                    color: '#58B3CC'
                }, {
                    offset: 1,
                    color: '#F58158'
                }], false),
                width: 1,
                opacity: 0.2,
                curveness: 0.1
            }
        },
        data: allData.moveLines
    }]
}; -->